Repository: OriIdan/creader
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: he_il

source: Password reminder for Helicon Books cloud reader
he_il: תזכורת סיסמה לקורא הענן של הליקון ספרים

source: You have requested a password reminder from Helicon Books cloud reader
he_il: ביקשת תזכורת סיסמה לקורא הענן של הליקון ספרים

source: Note: this password is only needed for deleting comments
he_il: הערה: הסיסמה דרושה אך ורק לצורך מחיקת הודעות

source: The password is
he_il: הסיסמה היא

source: Password reminder sent
he_il: תזכורת סיסמה נשלחה

source: You have successfully logged in
he_il: נכנסת בהצלחה למערכת

source: Invalid email or password
he_il: דואר אלקטרוני או סיסמה לא נכונים

source: Login to system
he_il: כניסה למערכת

source: Email
he_il: דואר אלקטרוני

source: Password
he_il: סיסמה

source: Submit
he_il: שליחה

source: Forgot password
he_il: שכחתי סיסמה

source: New comment in Helicon Books cloud reader
he_il: תגובה חדשה בקורא הענן של הליקון ספרים

source: New comment was received to a chapter you are following
he_il: נתקבלה תגובה חדשה לפרק שאת\ה עוקב\ת

source: Click the following link to see it
he_il: לחצ\י על הלינק הבא לקריאת התגובות

source: Invalid email address
he_il: דואר אלקטרוני לא תקין

source: Name field is required
he_il: יש למלא שדה שם

source: Comment is empty
he_il: תגובה ריקה

source: Add comment
he_il: הוספת תגובה

source: Name
he_il: שם

source: Email (will not be displayed)
he_il: דואר אלקטרוני (לא יוצג)

source: Send me email on comments
he_il: שלח לי הודעה על תגובות

source: Sumbit
he_il: שליחה

source: Login
he_il: כניסה

source: Delete comment
he_il: מחיקת תגובה

source: Helicon Books cloud based reader demo
he_il: הליקון ספרים - קורא ספרים מקוון
